app/controllers/spare_parts_controller.rb

INSERT INTO "spare_parts" ("brand", "carRegion", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["brand", "adsf"], ["carRegion", "adsf"], ["created_at", Wed, 02 Jul 2014 01:43:26 UTC +00:00], ["description", "asdf"], ["name", "asdf"], ["updated_at", Wed, 02 Jul 2014 01:43:26 UTC +00:00]]
---
  def create
    @sparePart = SparePart.new(spare_part_params)
    if @sparePart.save